app/Controllers/CRUD.php

INSERT INTO `version_control` (`id`, `task_id`, `time`) VALUES ('', '4', 1681771192)
DELETE FROM `version_control`
WHERE `id` IN ('12')
INSERT INTO `version_control` (`id`, `task_id`, `time`) VALUES ('', '3', 1681771298)
---
    private function versionControl($id) {
        $version_control_model = new \App\Models\VersionControlModel();
        $version_control_entity = new \App\Entities\VersionControl();

        $version_control_task = $version_control_model->findFromTaskId($id);

        if (empty($version_control_task)):
            $version_control_entity->task_id = $id;
            $version_control_entity->time = strtotime("now");
            return $version_control_model->save($version_control_entity);
        else:
            $diff_seconds = strtotime("now") - $version_control_task->time;

            if ($diff_seconds > 180):
                $version_control_model->delete(['id' => $version_control_task->id]);

                $version_control_entity->task_id = $id;
                $version_control_entity->time = strtotime("now");
                return $version_control_model->save($version_control_entity);