app/Models/TaskModel.php

SELECT *
FROM `task`
WHERE `user_id` = 10
---
    public function getSettingsByUserId($user_id = false) {
        if ($user_id === false) {
            return false;
        }

        return $this->asObject('App\Entities\Settings')->where(['id' => $user_id])->first();