app/Models/UserModel.php

    public function getAllUser(){
        return $this->asObject('App\Entities\User')->findAll();
---
SELECT *
FROM `users`