app/Models/VersionControlModel.php

SELECT *
FROM `version_control`
WHERE `task_id` = '3'
 LIMIT 1
---
    public function findFromTaskId($id = false){
        if ($id === false) {
            return $this->findAll();
        }

        return $this->asObject('App\Entities\VersionControl')->where(['task_id' => $id])->first();